# ExportFontTable Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontTable Constructor
ExportFontTable Class See Also
---
Constructs a new ExportFontTable with default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportFontTable()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportFontTable()
```

# See Also
ExportFontTable Class
Autodesk.Revit.DB Namespace